tutorial_09/app/views/user/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
<h2>Posts</h2>
<% @user.posts.each do |post| %>