tutorial_09/app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `public_flag`, `created_at`, `updated_at`, `user_id`) VALUES ('hello world', 'This is hello world', 1, '2022-01-11 06:53:34', '2022-01-11 06:53:34', 1)
---
  def create
    @user = User.find(params[:user_id])
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save