tutorial_08/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `description`, `public_flag`, `created_at`, `updated_at`, `user_name`) VALUES ('Third', 'This is the third post', 0, '2022-01-08 13:29:14', '2022-01-08 13:29:14', 'Susan')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `public_flag` = 1, `user_name` = 'Jone', `updated_at` = '2022-01-08 13:28:44' WHERE `posts`.`id` = 1